In [1]:
import pandas as pd

In [2]:
dict1={
    'name':['Rishant','a','b','c'],
    'age':[21,20,19,16]
}

In [4]:
dict2={
    'name':['Rishant','a','b'],
    'hobby':[1,2,3]
}

In [5]:
df1=pd.DataFrame(dict1)

In [6]:
df2=pd.DataFrame(dict2)

In [7]:
df1

      name  age
0  Rishant   21
1        a   20
2        b   19
3        c   16

In [8]:
df2

      name  hobby
0  Rishant      1
1        a      2
2        b      3

In [11]:
pd.merge(df1,df2,how='inner')

      name  age  hobby
0  Rishant   21      1
1        a   20      2
2        b   19      3

In [12]:
# merge will surely show the results with upper code but data must be diffrenet at some point